Tekla Open API Reference for Tekla Structures 2025
LineSegment.Point2 Property
 Gets the end point of the line segment
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point Point2 { get; set; }
Public Property Point2 As Point
	Get
	Set
Property Value
Type: Point
See Also
Reference
LineSegment Class
Tekla.Structures.Geometry3d Namespace